In [1]:
import pandas as pd
import numpy as np

What is DataFrame?

In [2]:
# Some Python lists

names = ['Varun', 'Anup', 'Pihu', 'Olive', 'Mrig', 'Tilda']
ages = [20, 30, 3, 23, 35, 45]
married = [False, False, True, False, True, True]

In [3]:
# Pandas Series

ser = pd.Series(names, name='name')

In [4]:
ser

0    Varun
1     Anup
2     Pihu
3    Olive
4     Mrig
5    Tilda
Name: name, dtype: object

In [5]:
# Pandas DataFrame

df = pd.DataFrame({'name': names, 'age': ages, 'married': married})

In [6]:
df

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True

Dataframes are two dimensional whereas series is one dimensional

In [7]:
ser.iloc[2]

'Pihu'

In [8]:
df.iloc[2, 0]

'Pihu'

In [9]:
df.iloc[2]

name       Pihu
age           3
married    True
Name: 2, dtype: object

In [10]:
# .ndim

ser.ndim

1

In [11]:
df.ndim

2

In [ ]:
# .shape

In [12]:
ser.shape

(6,)

In [13]:
df.shape

(6, 3)

Each Column in Data frame is a series. Each of these name, age, and married is like a series.

In [14]:
df

    name  age  married
0  Varun   20    False
1   Anup   30    False
2   Pihu    3     True
3  Olive   23    False
4   Mrig   35     True
5  Tilda   45     True

In [15]:
ser

0    Varun
1     Anup
2     Pihu
3    Olive
4     Mrig
5    Tilda
Name: name, dtype: object

In [16]:
df.name

0    Varun
1     Anup
2     Pihu
3    Olive
4     Mrig
5    Tilda
Name: name, dtype: object

In [ ]:
# Unlike Series dataframe could be Heterogenous

In [17]:
df.dtype

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [18]:
df.dtypes

name       object
age         int64
married      bool
dtype: object

Key thing to remember here is that the data frames itself does not have its own data type.